{
	"apps": [
		{
			"slug": "auth0",
			"url": "https://worldcoin.org/auth0",
			"githubUrl": "https://github.com/0xPenryn/auth0-world-id-social-connection",
			"image": {
				"sm": "/images/apps/auth0.svg",
				"lg": "/images/apps/auth0-lg.png"
			},
			"title": "Auth0",
			"subtitle": "marketplace.auth0.com",
			"description": "Add Sign In with Worldcoin to your Auth0 tenant in under 5 minutes. No code required.",
			"tags": ["Integration", "Sign In"],
			"body": "Auth0 is a flexible, drop-in solution to add authentication and authorization services to your applications. Your team and customers can securely sign in with a single identity provider to any cloud or on-premises application. Auth0 provides a universal authentication & authorization platform for web, mobile and legacy applications. It is loved by developers and trusted by enterprises.",
			"bookmark": true,
			"worldcoin": true
		},

		{
			"slug": "discord",
			"url": "https://discordbouncer.com",
			"githubUrl": "https://github.com/worldcoin/discord-bouncer",
			"image": {
				"sm": "/images/apps/discord.svg",
				"lg": "/images/apps/discord-lg.svg"
			},
			"title": "Discord",
			"subtitle": "discordbouncer.com",
			"description": "Prevent spam and increase the quality of the community by verifying humans.",
			"tags": ["App", "Integration", "API"],
			"body": "Discord Bouncer is a bot that allows you to verify that a user is a real person before they can join your Discord server. It is a great way to prevent spam and increase the quality of the community.",
			"bookmark": true,
			"worldcoin": true
		},

		{
			"slug": "lens",
			"url": "https://human.withlens.app",
			"githubUrl": "https://github.com/worldcoin/world-id-lens",
			"image": {
				"sm": "/images/apps/lens.svg",
				"lg": "/images/apps/lens-lg.svg"
			},
			"title": "Lens Protocol",
			"subtitle": "human.withlens.app",
			"description": "The decentralized social network. Verify a Lens profile belongs to real person. No bots, reduce spam.",
			"tags": ["On-chain", "Integration", "Social"],
			"body": "Lens is a decentralized social network built on the Polygon blockchain. Lens allows you to create a profile that is owned by you and only you. You can use your profile to interact with other Lens users, and you can use it to sign in to other Lens-enabled applications. This integration lets you prove that your Lens profile belongs to a real person.",
			"bookmark": false,
			"worldcoin": true
		},

		{
			"slug": "poap",
			"url": "https://poap.worldcoin.org",
			"githubUrl": "https://github.com/worldcoin/world-id-poap",
			"image": {
				"sm": "/images/apps/poap.svg",
				"lg": ""
			},
			"title": "POAP",
			"subtitle": "poap.worldcoin.org",
			"description": "The bookmarks of your life. Issue POAPs to humans only. One person, one POAP.",
			"tags": ["On-chain", "Integration"],
			"body": "POAPs are a great way to reward people for participating in events, and they are a great way to show off your participation in events. This integration lets you issue POAPs to Worldcoin-verified users only, to ensure your rewards for participants aren't able to sybil-attack the system.",
			"worldcoin": true
		},

		{
			"slug": "worldcoin",
			"url": "https://worldcoin.org",
			"githubUrl": "https://github.com/worldcoin/world-id-example-airdrop",
			"image": {
				"sm": "/images/apps/wld.svg",
				"lg": ""
			},
			"title": "Worldcoin",
			"subtitle": "worldcoin.org",
			"description": "The first token to be globally and freely distributed to people, just for being a unique individual.",
			"tags": ["On-chain", "App"],
			"body": "Worldcoin is building the world's largest identity and financial network as a public utility, giving ownership to everyone.",
			"worldcoin": true
		},

		{
			"slug": "mina-world-id",
			"url": "https://ethglobal.com/showcase/world-id-mina-embt9",
			"githubUrl": "https://github.com/mitschabaude/mina-world-id",
			"image": {
				"sm": "/images/apps/ethbogota.jpg"
			},
			"title": "World ID on Mina",
			"subtitle": "mitschabaude/mina-world-id",
			"description": "Implementing the World ID system in snarkyjs, making PoP available for Mina smart contracts.",
			"tags": ["Hackathon Project", "On-chain", "Integration"],
			"body": "This project is an exploration in what it takes to make World IDs - the proofs of personhood (PoP) issues by Worldcoin - available on Mina zkApps. We ported Semaphore to snarkyjs and create an e2e demo by adding a mock sequencer (which maintains the PoP Merkle tree) and a demo UI showing 2 simple PoP use cases.",
			"worldcoin": false
		},

		{
			"slug": "starksight",
			"url": "https://devfolio.co/projects/starksight-5d82",
			"githubUrl": "https://github.com/HerodotusDev/starksight-zkhack",
			"image": {
				"sm": "/images/apps/zkhack.png"
			},
			"title": "StarkSight",
			"subtitle": "HerodotusDev/starksight-zkhack",
			"description": "Using Herodotus to make World ID verifiable on Starknet.",
			"tags": ["Hackathon Project", "On-chain", "Integration"],
			"body": "Many projects make use of ZK-SNARK technology to achieve either scalability or privacy (like Worldcoin). Using groth16 over the curve BN254 is a very common practice, as Ethereum has a precompile for pairings over this curve. The problem is that other chains, like Starknet don't, and they also operate over a different field. Garaga emulates the BN254 curve over the Stark field, being able to perform the 3 pairings needed to verify the groth16 proof. Furthermore, WorldID verification is only accessible on the chains where the Merkle Roots are stored. By using Herodotus we can make the roots available on any Ethereum layer, thus, making WorldID verifiable anywhere.",
			"worldcoin": false
		}
	]
}
